# -*- coding: utf-8 -*-
"""Занятие 4. Домашнее задание. Основы программирования на Python.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1mNQMWvTCwocvuqnjskZ74Jp7Pw7rCDac
"""

import random as rd
import re
from collections import Counter
from datetime import datetime
from google.colab import drive

drive.mount('/content/drive', force_remount=True)

"""# LIGHT

1. Напишите функцию (F): на вход список имен и целое число N; на выходе список длины N случайных имен из первого списка (могут повторяться, можно взять значения: количество имен 20, N = 100, рекомендуется использовать функцию random);
"""

name_list = ["Маша", "Петя", "Александра", "Леопольд", "Гаврила", "Матвей", "Дмитрий", "Юлия", "Екатерина", "Настя", "Григорий", "Гершель", "Святополк", "Изяслав", "Тимофей", "Зоя", "Елена", "Евфросинья", "Том", "Джерри"]

def name_length(name_list, N):
  my_list = []
  name_length = []
  for i in range (1, N+1):
    my_list += rd.sample(name_list, 1)
    name_length += map(len, my_list)
  return (name_length)

print(name_length(name_list, 100))

"""2. Напишите функцию вывода самого частого имени из списка на выходе функции F;"""

def top_name(name_list, N):
  new_list2 = []
  for i in range (1, N+1):
    new_list2 += rd.sample(name_list, 1)
    shortlist = dict(Counter(new_list2))
    n = max(shortlist.values())
    topname = list(filter(lambda k: shortlist[k] == n, shortlist))
  print("В списке на выходе функции чаще всего повторяется имя (имена)")
  return (topname)

top_name(name_list, 100)

"""3. Напишите функцию вывода самой редкой буквы, с которого начинаются имена в списке на выходе функции F"""

def top_letter(name_list, N):
  new_list = []
  for i in range (1, N+1):
    new_list += rd.sample(name_list, 1)
    new_list2 = str(new_list)
    new_list2 = re.sub("[^А-Я]", "", new_list2)
    cd = dict(Counter(new_list2))
    i = min(cd.values())
    first_letter = list(filter(lambda k: cd[k] == i, cd))
  
  print("В списке имен на выходе функции реже всего встречается (встречаются) начальная буква (буквы):" )
  return(first_letter)

print(top_letter(name_list, 100))

"""# PRO

4.  В файле с логами найти дату самого позднего лога (по метке времени): https://drive.google.com/open?id=1pKGu-u2Vvtx4xK8i2ZhOzE5rBXyO4qd8
"""

file = open('/content/drive/My Drive/log', encoding='UTF-8') 

last_log = 0
date_log = 0
for line in file:
    if not last_log:
      last_log = datetime.strptime(line[11:19], '%H:%M:%S')
      continue
    log = datetime.strptime(line[11:19], '%H:%M:%S')
    if log > last_log:
      last_log = log #самый поздний лог по метке времени
#снова переберем в цикле линии и вернем дату самому позднему времени лога
    for line in file:
        date_log = datetime.strptime(line[:19], '%Y-%m-%d %H:%M:%S')
        if last_log > datetime.strptime(line[11:19], '%H:%M:%S'):
           continue
        if last_log == datetime.strptime(line[11:19], '%H:%M:%S'):
           date_log = datetime.strptime(line[:19], '%Y-%m-%d %H:%M:%S')
    print("Дата самого позднего по времени лога", date_log)